In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/jrt/Downloads/RPC12_Input_For_Participants/datasets/electric_vehicle_sales_by_makers.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   date                    816 non-null    object
 1   vehicle_category        816 non-null    object
 2   maker                   816 non-null    object
 3   electric_vehicles_sold  816 non-null    int64
dtypes: int64(1), object(3)
memory usage: 25.6+ KB

In [4]:
df.head()

        date vehicle_category         maker  electric_vehicles_sold
0  01-Apr-21       2-Wheelers  OLA ELECTRIC                       0
1  01-Apr-22       2-Wheelers      OKAYA EV                       0
2  01-May-21       2-Wheelers  OLA ELECTRIC                       0
3  01-Jun-21       2-Wheelers  OLA ELECTRIC                       0
4  01-Jul-21       2-Wheelers  OLA ELECTRIC                       0

In [5]:
df.tail()

          date vehicle_category            maker  electric_vehicles_sold
811  01-Mar-24       2-Wheelers           BGAUSS                    3070
812  01-Mar-24       2-Wheelers  BATTRE ELECTRIC                     625
813  01-Mar-24       2-Wheelers    KINETIC GREEN                    3915
814  01-Mar-24       2-Wheelers           REVOLT                     585
815  01-Mar-24       2-Wheelers           OTHERS                   10579

In [6]:
df.shape

(816, 4)

In [6]:
df[df.duplicated()] # No duplicates

Empty DataFrame
Columns: [date, vehicle_category, maker, electric_vehicles_sold]
Index: []

In [7]:
df.dtypes

date                      object
vehicle_category          object
maker                     object
electric_vehicles_sold     int64
dtype: object

In [8]:
df.describe()

       electric_vehicles_sold
count              816.000000
mean              2531.998775
std               4771.077333
min                  0.000000
25%                 42.000000
50%                662.000000
75%               2636.500000
max              44630.000000

In [28]:
# Find out the unique values for vechile category and maker

df['maker'].unique()
df['vehicle_category'].value_counts()

vehicle_category
2-Wheelers    456
4-Wheelers    360
Name: count, dtype: int64

In [17]:
check_ = ['maker', 'vehicle_category']

In [43]:
def check_unique_and_counts(df, columns):
    for column in columns:
        if column in df.columns:
            unique = df[column].unique()
            print(f'the unique values of {column}: \n{unique}\n')
            unique_count = df[column].value_counts()
            print(f'the unique value counts of {column}: {unique_count}\n\n')
        else:
            print(f'the column {column} does not exist in dataframe')

In [44]:
check_unique_and_counts(df, check_)

the unique values of maker:
['OLA ELECTRIC' 'OKAYA EV' 'BYD India' 'PCA Automobiles' 'BMW India'
 'Volvo Auto India' 'KIA Motors' 'Mercedes -Benz AG' 'Tata Motors'
 'MG Motor' 'Mahindra & Mahindra' 'Hyundai Motor' 'HERO ELECTRIC'
 'OKINAWA' 'AMPERE' 'ATHER' 'PURE EV' 'TVS' 'REVOLT' 'BAJAJ' 'BEING'
 'JITENDRA' 'OTHERS' 'BGAUSS' 'BATTRE ELECTRIC' 'KINETIC GREEN']

the unique value counts of maker: maker
OLA ELECTRIC           36
Mahindra & Mahindra    36
OTHERS                 36
BAJAJ                  36
REVOLT                 36
TVS                    36
ATHER                  36
AMPERE                 36
HERO ELECTRIC          36
Hyundai Motor          36
OKINAWA                36
MG Motor               36
Tata Motors            36
Mercedes -Benz AG      36
KIA Motors             36
Volvo Auto India       36
BMW India              36
PCA Automobiles        36
BYD India              36
OKAYA EV               24
PURE EV                24
BEING                  24
JITENDRA               24
BGAUSS                 12
BATTRE ELECTRIC        12
KINETIC GREEN          12
Name: count, dtype: int64


the unique values of vehicle_category:
['2-Wheelers' '4-Wheelers']

the unique value counts of vehicle_category: vehicle_category
2-Wheelers    456
4-Wheelers    360
Name: count, dtype: int64

In [47]:
df['date'] = pd.to_datetime(df['date'], format = '%d-%b-%y')

In [48]:
df.to_csv('ev_makers_clean.csv', index=False, encoding = 'utf-8')